tutorial/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.5e-06;

vertices        
(
    (0 0 0)			// 0
    (4400 0 0)			// 1
    (0 100 -4.36609429085)	// 2
    (4400 300 -13.0982828726)	// 3
    (0 400 -17.4643771634)	// 4
    (4400 700 -30.562660036)	// 5
    (0 800 -34.9287543268)	// 6
    (4400 1000 -43.6609429085)	// 7
    (0 1600 -69.8575086536)	// 8
    (4400 1600 -69.8575086536)	// 9

    (0 100 4.36609429085)	// 10
    (4400 300 13.0982828726)	// 11
    (0 400 17.4643771634)	// 12
    (4400 700 30.562660036)	// 13
    (0 800 34.9287543268)	// 14
    (4400 1000 43.6609429085)	// 15
    (0 1600 69.8575086536)	// 16
    (4400 1600 69.8575086536)	// 17
    
    (-528 100 -4.36609429085)	// (2) 18 added
    (-528 100 4.36609429085)	// (10) 19 added
    (-528 0 0)			// 20 added
);

blocks          
(
    hex (20 0 2 18 20 0 10 19) 
    (12 30 1) 
    edgeGrading (1 1 1 1 1 0.1666667 0.1666667 1 1 1 1 1) //modify 
    
    hex (0 1 3 2 0 1 11 10) 
    (100 30 1) 
    edgeGrading (1 1 1 1 0.1666667 1 1 0.1666667 1 1 1 1)

    hex (2 3 5 4 10 11 13 12)
    (100 40 1)
    edgeGrading (1 1 1 1 20 1 1 20 1 1 1 1)
 
    hex (4 5 7 6 12 13 15 14)
    (100 15 1)
    simpleGrading (1.0 1.0 1.0)
    
    hex (6 7 9 8 14 15 17 16)
    (100 15 1)
    simpleGrading (1.0 1.0 1.0)
);

edges           
(
);

boundary
(
    axis
    {
        type empty;
        faces
        (
            (0 1 1 0) 
            (20 0 0 20) //added
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (20 20 19 18)  // changed
        );
    }
    injector
    {
        type wall;
        faces
        (
            (2 10 12 4)  // changed
            (18 19 10 2)
        );
    }
    exterior
    {
        type patch;
        faces
        (
            //(2 10 12 4) this is a wall parallel to air inlet
            (4 12 14 6)
            (6 14 16 8)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (8 16 17 9)
            (7 9 17 15)
            (5 7 15 13)
            (3 5 13 11)
            (1 3 11 1)
        );
    }

    front
    {
        type wedge;
        faces
        (
            (0 1 11 10)
            (20 0 10 19) //added
            (10 11 13 12)
            (12 13 15 14)
            (14 15 17 16)
        );
    }

    back
    {
        type wedge;
        faces
        (
            (20 0 2 18) //added
            (0 2 3 1)
            (2 4 5 3)
            (4 6 7 5)
            (6 8 9 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
