tutorial/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

RAS
{
    RASModel        kEpsilon;

    turbulence      on;

    printCoeffs     on;
    kEpsilonCoeffs
    {
        Cmu         0.09;
        C1          1.6;
        C2          1.92;
        sigmaEps    1.11; //Original value:1.44. Proposed value from CMT:1.6
        // See:
        // D.M. Hargreaves and N.G. Wright
        // "On the use of the k-Epsilon model in commercial CFD software
        // to model the neutral atmospheric boundary layer",
        // J. of wind engineering and industrial aerodymanics,
        // 95(2007) 355-269
    }
}

LES                                                                             
{                                                                               
    LESModel        WALE;                                                
                                                                                
    delta       cubeRootVol;                                                    
                                                                                
    turbulence      on;                                                         
                                                                                
    printCoeffs     on;                                                         
                                                                                
    cubeRootVolCoeffs                                                           
    {                                                                           
        deltaCoeff      1;                                                      
    }                                                                           
}                                                                               
 

// ************************************************************************* //
