tutorial/system/sampleDict
 /*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat       raw;

sets
(


    transv2
    {
	type    uniform;
        axis    y;
        start   ( 0.0015 0 0);
        end     ( 0.0015 0.000550 0);
        nPoints 55;
    }

 




);

fields          ( ElsaSD32 ElsaSigmaPrime);


// ************************************************************************* //
