tutorial/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`
echo $application
runApplication blockMesh
cp 0/alpha.diesel.orig 0/alpha.diesel
runApplication setFields
runApplication $application


# ----------------------------------------------------------------- end-of-file
